CREATE TABLE test_sql (
  st_ord TEXT,
  type_product_name TEXT,
  product_infosource1 TEXT,
  create_date TEXT,
  index_lead INTEGER DEFAULT 1,
  index_issue INTEGER DEFAULT 1,
  index_sum float
);

insert into test_sql (st_ord, type_product_name, product_infosource1, create_date, index_sum)
VALUES
    ("Согласие", "Обычная заявка", "source1", "30.11.2017", 1600000),
    ("Согласие", "Обычная заявка", "source2", "05.02.2018", 2376000),
    ("Согласие", "Обычная заявка", "source5", "27.12.2017", 4860000),
    ("Согласие", "Обычная заявка", "source6", "07.03.2018", 1500000),
    ("Не подходит по критериям", "Обычная заявка", "source6", "29.03.2018", 3500000),
    ("Согласие", "Заявка не для обработки", "source4", "26.06.2018", 1800000),
    ("Согласие", "Заявка не для обработки", "source3", "06.06.2018", 3200000),
    ("", "Заявка не для обработки", "source3", "21.06.2018", 3375900),
    ("Согласие", "Заявка не для обработки", "source3", "19.06.2018", 3200000),
    ("Согласие", "Обычная заявка", "source5", "26.07.2018", 1288000),
    ("Согласие", "Обычная заявка", "source5", "23.07.2018", 1275400),
    ("Согласие", "Обычная заявка", "source5", "31.07.2018", 1600000),
    ("Не подходит по критериям", "Обычная заявка", "source5", "30.09.2018", 1764000),
    ("Согласие", "Обычная заявка", "source5", "03.08.2018", 4000000),
    ("Согласие", "Обычная заявка", "source5", "26.07.2018", 1450000),
    ("Отказ", "Обычная заявка", "source5", "06.09.2018", 2363960.71),
    ("Согласие", "Обычная заявка", "source5", "27.08.2018", 2486939),
    ("Согласие", "Обычная заявка", "source5", "28.08.2018", 2576693.63),
    ("Согласие", "Обычная заявка", "source5", "08.10.2018", 1604125),
    ("Согласие", "Обычная заявка", "source5", "30.07.2018", 940000),
    ("Согласие", "Заявка не для обработки", "source4", "09.07.2018", 5000000);

