CREATE TABLE pe_test_abnt (
  tbm DATE NOT NULL,
  act_day DATE NOT NULL,
  app_n INtEGER PRIMARY KEY,
  region INTEGER NOT NULL,
  tp_group INTEGER NOT NULL
);

CREATE TABLE pe_test_clc (
  tbm DATE NOT NULL,
  app_n INtEGER PRIMARY KEY,
  revenue INTEGER NOT NULL,
  abon_rev INTEGER
);

CREATE TABLE pe_test_regions (
  region INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
  region_name TEXT NOT NULL
);

CREATE TABLE pe_test_tariffs (
  tp_group INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
  tp_group_name TEXT NOT NULL
);

INSERT INTO pe_test_abnt (tbm, act_day, app_n, region, tp_group)
VALUES 
	('2017-01-01', '2009-02-15', 9295, 10, 299),
	('2017-01-01', '2012-12-21', 8232, 55, 300),
	('2018-05-01', '2017-07-03', 2993, 5, 261),
	('2018-05-01', '2018-04-24', 3526, 34, 379); 

INSErT INTO pe_test_clc (tbm, app_n, revenue, abon_rev)
VALUES
	('2017-01-01', 9295, 100, 0),
	('2017-01-01', 8232, 350, 300),
	('2018-05-01', 2993, 0, 0),
	('2018-05-01', 3526, 700, 200);

INSERT INTO pe_test_regions (region_name)
VALUES
	('Анадырь'),
	('Биробиджан'),
	('Майкоп'),
	('Горно-Алтайск'),
	('Уфа'),
	('Улан-Удэ'),
	('Нальчик'),
	('Магас'),
	('Сыктывкар'),
	('Йошкар-Ола'),
	('Элиста'),
	('Грозный');

INSERT INTO pe_test_tariffs (tp_group_name)
VALUES
	('Супер МТС'),
	('Smart'),
	('ULTRA'),
	('МЫ МТС'),
	('Тарифище'),
	('НЕТАРИФ')
	('Хайп'),
	('Мой Безлимитище');
    
INSERT INTO pe_test_abnt (tbm, act_day, app_n, region, tp_group) 
VALUES 
	('2014-12-24', '2022-01-23', 5011, 10, 3),
	('2009-05-16', '2009-03-10', 7489, 2, 5),
	('2019-07-09', '2021-10-28', 1928, 1, 3),
	('2014-09-02', '2020-10-28', 9283, 7, 3),
	('2016-12-14', '2012-03-15', 8871, 11, 3),
	('2013-04-28', '2018-04-05', 1379, 8, 6),
	('2016-11-25', '2017-12-18', 3106, 3, 1),
	('2013-12-30', '2021-03-02', 9058, 6, 7),
	('2009-11-14', '2013-07-28', 3802, 6, 8),
	('2014-06-09', '2017-06-20', 6979, 9, 1),
	('2018-03-05', '2013-08-16', 9133, 7, 5),
	('2017-08-14', '2009-11-13', 5367, 8, 6),
	('2014-09-18', '2021-11-05', 9109, 6, 3),
	('2011-09-26', '2021-11-20', 2918, 10, 3),
	('2020-09-27', '2014-05-08', 5838, 5, 4),
	('2010-03-31', '2021-05-21', 1557, 3, 7),
	('2017-01-13', '2014-11-12', 8018, 4, 4),
	('2014-06-20', '2009-12-26', 8273, 3, 5),
	('2021-03-31', '2014-09-10', 3482, 8, 8),
	('2021-11-23', '2014-02-17', 5459, 8, 2);

INSERT INTO pe_test_clc (tbm, app_n, revenue, abon_rev)
VALUES
	('2014-12-24', 5011, 100, 0),
	('2009-05-16', 7489, 350, 300),
	('2019-07-09', 1928, 0, 0),
	('2014-09-02', 9283, 700, 200),
	('2016-12-14', 8871, 500, 0),
	('2013-04-28', 1379, 0, 200),
	('2016-11-25', 3106, 0, 0),
	('2013-12-30', 9058, 600, 100),
	('2009-11-14', 3802, 0, 300),
	('2014-06-09', 6979, 100, 0),
	('2018-03-05', 9133, 350, 0),
	('2017-08-14', 5367, 400, 100),
	('2014-09-18', 9109, 0, 300),
	('2011-09-26', 2918, 100, 0),
	('2020-09-27', 5838, 250, 100),
	('2010-03-31', 3482, 0, 350),
	('2021-11-23', 5459, 0, 500);
